import '../CSS/Selfintro.css';

const SelfIntro = () => {
  return (
    <div id ="selfIntro">
            <div class ="division">
        <h3>성장과정</h3>
        <p>
         저는 중학교까지는 유복하고 행복한 가정에서 자라왔습니다. 하지만 집안 사정이 안좋아지고 힘든시간을 보내며 다시 
         열심히 가족끼리 극복해 나가는 과정을 느끼며 지켜보면서 같이 협력하면서 이겨내가면 여렵던 상황도 극복할 수 있다는것을 
         느꼈습니다. 그리고 이와 비슷하게 군대에 있을때 어렵고 말도 안되보이는 작업을 받았을때 선후임과 역할을 나누어 
         같이 협동하면 해낼수 있다는것을 느꼈습니다.
        </p>
      </div>
      
      <div class ="division">
        <h3>취미와 특기</h3>
        <p>
          저는 축구하는것을 좋아합니다. 어릴때는 혼자 드리블하며 골을 넣는것이 잘하고 이기는 방법인줄 알았지만 
          학교,군대등을 거치면서 혼자 드리블하는것 보다 패스하고 팀을 믿으며 움직이는것이 더 중요한 것을 배웠습니다.
          그리고 저의 특기는 암기와 분석입니다. 어떤것을 외울때 남들보다 빠르게 외웋수 있는 특기가 있고 암기뿐만 아니라 
          어떤것을 배울때 모르는게 있으면 무작정 암기하기보다 어떤상황에서 주로 쓰이는지등을 분석하며 공부할 수 있는 특기가 있습니다.
        </p>
      </div>
      
      <div class ="division">
        <h3>입사지원동기 </h3>
        <p>
        저는 이곳에서 프론트엔드 개발자로서 저의 역량을 발휘하고,
         더 높은 기술적 성장을 이루고자 지원하게 되었습니다. 이 회사는 최신 웹 트렌드와 기술 스택을 적극적으로 도입하는 것으로 알려져 있으며, 
         특히 사용자 경험을 중시하는 개발 문화가 매력적으로 느껴졌습니다. 프론트엔드 개발자는 사용자와 직접 만나는 인터페이스를 구축하며,
         이를 통해 브랜드의 가치를 전달하는 중요한 역할을 합니다. 저 역시 이러한 역할을 통해 의미 있는 성과를 내고 싶어 지원하게 되었습니다.
        </p>
      </div>

      <div class ="division">
        <h3>포부 및 장래계획 </h3>
        <p>
          저는 남들보다 배우는게 빠르고 적응도 빠르기 때문에 저는 이 회사와 함께 성장해 서로에게 좋은 시너지를 내며
          일을 하고 싶습니다. 저는 아르바이트를 보통 2년 이상씩해왔기 때문에 한번적응하면 회사에서 만족하게 일을 할 수 있고
          저 또한 회사에서 오래동안 일을 하는것을 선호합니다.
        </p>  
      </div>
    </div>
  );
};

export default SelfIntro;